In [3]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)

result = df.query('Age > 30' and 'Salary>60000')
print(result)

      Name  Age  Salary
2  Charlie   35   70000
3    David   40   80000

In [7]:
# Create a new column 'Adjusted Salary' based on conditions
df['Adjusted Salary'] = df.eval('Salary * 1.10')
print(df)

SyntaxError: invalid syntax (<unknown>, line 1)

In [9]:
import sqlite3

# Create a SQLite database connection
conn = sqlite3.connect('example.db')

# Create a sample table and insert data
conn.execute('''CREATE TABLE IF NOT EXISTS employees (id INT, name TEXT, age INT, salary REAL)''')
conn.execute('INSERT INTO employees (id, name, age, salary) VALUES (1, 'Alice', 25, 50000)')
conn.execute('INSERT INTO employees (id, name, age, salary) VALUES (2, 'Bob', 30, 60000)')
conn.execute('INSERT INTO employees (id, name, age, salary) VALUES (3, 'Charlie', 35, 70000)')
conn.execute("INSERT INTO employees (id, name, age, salary) VALUES (4, 'David', 40, 80000)")

# Query the database using SQL
query = "SELECT * FROM employees WHERE age > 30"
df = pd.read_sql_query(query, conn)

print(df)

   id     name  age   salary
0   3  Charlie   35  70000.0
1   4    David   40  80000.0

In [16]:
import sqlite3

conn=sqlite3.connect("example1.db")

conn.execute("create table if not exists employee(id int,name text,age int,salary real)")
conn.execute(' insert into employee(id,name,age,salary) values (1,"meet",17,420000)  ')
conn.execute(' insert into employee(id,name,age,salary) values (1,"meet1",18,420400) ')
conn.execute(' insert into employee(id,name,age,salary) values (1,"mee2t",19,420300) ')
conn.execute('insert into employee(id,name,age,salary) values (1,"meet3",17,420200) ')

In [17]:
data="select * from employee"
df=pd.read_sql_query(data,conn)
print(df)

   id   name  age    salary
0   1   meet   17  420000.0
1   1  meet1   18  420400.0
2   1  mee2t   19  420300.0
3   1  meet3   17  420200.0
4   1   meet   17  420000.0
5   1  meet1   18  420400.0
6   1  mee2t   19  420300.0
7   1  meet3   17  420200.0

In [24]:
import pandas as pd

data = {
    'first_name': ['John', 'Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'last_name': ['Doe', 'Smith', 'Brown', 'Johnson', 'Lee', 'Taylor'],
    'role': ['Sales Representative', 'Manager', 'Sales Man', 'Sales Representative', 'Sales Man', 'Developer'],
    'date_of_joining': ['2020-01-15', '2019-03-22', '2021-04-10', '2018-06-13', '2022-05-30', '2020-11-07']
}

df = pd.DataFrame(data)

df['date_of_joining'] = pd.to_datetime(df['date_of_joining'])

result = df[df['role'].isin(['Sales Representative', 'Sales Man'])]

result=result[['first_name',"last_name","date_of_joining","role"]]

In [21]:
print(result)

  first_name last_name date_of_joining                  role
0       John       Doe      2020-01-15  Sales Representative
2        Bob     Brown      2021-04-10             Sales Man
3    Charlie   Johnson      2018-06-13  Sales Representative
4      David       Lee      2022-05-30             Sales Man

In [23]:
import sqlite3
import pandas as pd
conn = sqlite3.connect("sqlite.db")
conn.execute('''
CREATE TABLE IF NOT EXISTS employee (
    id INTEGER PRIMARY KEY,
    first_name TEXT,
    last_name TEXT,
    role TEXT,
    date_of_joining TEXT
)
''')
conn.execute("INSERT OR IGNORE INTO employee (id, first_name, last_name, role, date_of_joining) VALUES (1, 'John', 'Doe', 'Sales Representative', '2020-01-15')")
conn.execute("INSERT OR IGNORE INTO employee (id, first_name, last_name, role, date_of_joining) VALUES (2, 'Alice', 'Smith', 'Manager', '2019-03-22')")
conn.execute("INSERT OR IGNORE INTO employee (id, first_name, last_name, role, date_of_joining) VALUES (3, 'Bob', 'Brown', 'Sales Man', '2021-04-10')")
conn.execute("INSERT OR IGNORE INTO employee (id, first_name, last_name, role, date_of_joining) VALUES (4, 'Charlie', 'Johnson', 'Sales Representative', '2018-06-13')")
conn.execute("INSERT OR IGNORE INTO employee (id, first_name, last_name, role, date_of_joining) VALUES (5, 'David', 'Lee', 'Sales Man', '2022-05-30')")
conn.execute("INSERT OR IGNORE INTO employee (id, first_name, last_name, role, date_of_joining) VALUES (6, 'Eve', 'Taylor', 'Developer', '2020-11-07')")
conn.commit()
query = """
SELECT first_name, last_name, date_of_joining
FROM employee
WHERE role IN ('Sales Representative', 'Sales Man')
"""
df = pd.read_sql_query(query, conn)
print(df)
conn.close()

  first_name last_name date_of_joining
0       John       Doe      2020-01-15
1        Bob     Brown      2021-04-10
2    Charlie   Johnson      2018-06-13
3      David       Lee      2022-05-30